sergev/pic32prog/adapter-pickit2.c
/*
 * Interface to PIC32 ICSP port using Microchip PICkit2 USB adapter.
 *
 * Copyright (C) 2011 Serge Vakulenko
 *
 * This file is part of PIC32PROG project, which is distributed
 * under the terms of the GNU General Public License (GPL).
 * See the accompanying file "COPYING" for more details.
 */
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <fcntl.h>
#include <string.h>
#include <errno.h>
#include <usb.h>

#include "adapter.h"
#include "hidapi.h"
#include "pickit2.h"
#include "pic32.h"

typedef struct {
    /* Common part */
    adapter_t adapter;

    /* Device handle for libusb. */
    hid_device *hiddev;

    unsigned char reply [64];
    unsigned use_executable;
    unsigned serial_execution_mode;

} pickit2_adapter_t;

/*
 * Identifiers of USB adapter.
 */
#define MICROCHIP_VID           0x04d8
#define PICKIT2_PID             0x0033  /* Microchip PICkit 2 */

/*
 * USB endpoints.
 */
#define OUT_EP                  0x01
#define IN_EP                   0x81

#define IFACE                   0
#define TIMO_MSEC               1000

static void pickit2_send_buf (pickit2_adapter_t *a, unsigned char *buf, unsigned nbytes)
{
    if (debug_level > 0) {
        int k;
        fprintf (stderr, "---Send");
        for (k=0; k<nbytes; ++k) {
            if (k != 0 && (k & 15) == 0)
                fprintf (stderr, "\n       ");
            fprintf (stderr, " %02x", buf[k]);
        }
        fprintf (stderr, "\n");
    }
    hid_write (a->hiddev, buf, 64);
}

static void pickit2_send (pickit2_adapter_t *a, unsigned argc, ...)
{
    va_list ap;
    unsigned i;
    unsigned char buf [64];

    memset (buf, CMD_END_OF_BUFFER, 64);
    va_start (ap, argc);
    for (i=0; i<argc; ++i)
        buf[i] = va_arg (ap, int);
    va_end (ap);
    pickit2_send_buf (a, buf, i);
}

static void pickit2_recv (pickit2_adapter_t *a)
{
    if (hid_read (a->hiddev, a->reply, 64) != 64) {
        fprintf (stderr, "PICkit2: error receiving packet\n");
        exit (-1);
    }
    if (debug_level > 0) {
        int k;
        fprintf (stderr, "--->>>>");
        for (k=0; k<64; ++k) {
            if (k != 0 && (k & 15) == 0)
                fprintf (stderr, "\n       ");
            fprintf (stderr, " %02x", a->reply[k]);
        }
        fprintf (stderr, "\n");
    }
}

static void check_timeout (pickit2_adapter_t *a, const char *message)
{
    unsigned status;

    pickit2_send (a, 2, CMD_READ_STATUS);
    pickit2_recv (a);
    status = a->reply[0] | a->reply[1] << 8;
    if (status & STATUS_ICD_TIMEOUT) {
        fprintf (stderr, "PICkit2: timed out at %s, status = %04x\n",
            message, status);
        exit (-1);
    }
}

/*
 * Put device to serial execution mode.
 */
static void serial_execution (pickit2_adapter_t *a)
{
    if (a->serial_execution_mode)
        return;
    a->serial_execution_mode = 1;

    // Enter serial execution.
    if (debug_level > 0)
        fprintf (stderr, "PICkit2: enter serial execution\n");
    pickit2_send (a, 29, CMD_EXECUTE_SCRIPT, 27,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_STATUS,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_ASSERT_RST,
        SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
        SCRIPT_JT2_SETMODE, 6, 0x1F,
        SCRIPT_JT2_SENDCMD, ETAP_EJTAGBOOT,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_DEASSERT_RST,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_FLASH_ENABLE);
}

/*
 * Download programming executable (PE).
 */
static void pickit2_load_executable (adapter_t *adapter)
{
    pickit2_adapter_t *a = (pickit2_adapter_t*) adapter;

    //fprintf (stderr, "PICkit2: load_executable\n");
    a->use_executable = 1;
    serial_execution (a);

#define WORD_AS_BYTES(w)  (unsigned char) (w), \
                          (unsigned char) ((w) >> 8), \
                          (unsigned char) ((w) >> 16), \
                          (unsigned char) ((w) >> 24)

    if (debug_level > 0)
        fprintf (stderr, "PICkit2: download PE loader\n");
    pickit2_send (a, 45, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 28,
            WORD_AS_BYTES (0x3c04bf88),         // step 1
            WORD_AS_BYTES (0x34842000),
            WORD_AS_BYTES (0x3c05001f),
            WORD_AS_BYTES (0x34a50040),
            WORD_AS_BYTES (0xac850000),
            WORD_AS_BYTES (0x34050800),         // step 2
            WORD_AS_BYTES (0xac850010),
        CMD_EXECUTE_SCRIPT, 12,                 // execute
            SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
            SCRIPT_JT2_SETMODE, 6, 0x1F,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF);
    check_timeout (a, "step1");

    pickit2_send (a, 30, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 20,
            WORD_AS_BYTES (0x34058000),         // step 3
            WORD_AS_BYTES (0xac850020),
            WORD_AS_BYTES (0xac850030),
            WORD_AS_BYTES (0x3c04a000),         // step 4
            WORD_AS_BYTES (0x34840800),
        CMD_EXECUTE_SCRIPT, 5,                  // execute
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF);
    check_timeout (a, "step3");

    // Download the PE loader
    int i;
    for (i=0; i<PIC32_PE_LOADER_LEN; i+=2) {
        pickit2_send (a, 25, CMD_CLEAR_DOWNLOAD_BUFFER,
            CMD_DOWNLOAD_DATA, 16,
                WORD_AS_BYTES ((0x3c060000 | pic32_pe_loader[i])),  // step 5
                WORD_AS_BYTES ((0x34c60000 | pic32_pe_loader[i+1])),
                WORD_AS_BYTES (0xac860000),
                WORD_AS_BYTES (0x24840004),
            CMD_EXECUTE_SCRIPT, 4,              // execute
                SCRIPT_JT2_XFERINST_BUF,
                SCRIPT_JT2_XFERINST_BUF,
                SCRIPT_JT2_XFERINST_BUF,
                SCRIPT_JT2_XFERINST_BUF);
        check_timeout (a, "step5");
    }

    // Jump to PE loader
    pickit2_send (a, 42, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 16,
            WORD_AS_BYTES (0x3c19a000),         // step 6
            WORD_AS_BYTES (0x37390800),
            WORD_AS_BYTES (0x03200008),
            WORD_AS_BYTES (0x00000000),
        CMD_EXECUTE_SCRIPT, 21,                 // execute
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
            SCRIPT_JT2_SETMODE, 6, 0x1F,
            SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
            SCRIPT_JT2_XFRFASTDAT_LIT,
                0, 9, 0, 0xA0,                  // PE_ADDRESS = 0xA000_0900
            SCRIPT_JT2_XFRFASTDAT_LIT,
                (unsigned char) PIC32_PE_LEN,   // PE_SIZE
                (unsigned char) (PIC32_PE_LEN >> 8),
                0, 0);
    check_timeout (a, "step6");

    // Download the PE itself (step 7-B)
    if (debug_level > 0)
        fprintf (stderr, "PICkit2: download PE\n");
    int nloops = (PIC32_PE_LEN + 9) / 10;
    for (i=0; i<nloops; i++) {                  // download 10 at a time
        int j = i * 10;
        pickit2_send (a, 55, CMD_CLEAR_DOWNLOAD_BUFFER,
            CMD_DOWNLOAD_DATA, 40,
                WORD_AS_BYTES (pic32_pe[j]),
                WORD_AS_BYTES (pic32_pe[j+1]),
                WORD_AS_BYTES (pic32_pe[j+2]),
                WORD_AS_BYTES (pic32_pe[j+3]),
                WORD_AS_BYTES (pic32_pe[j+4]),
                WORD_AS_BYTES (pic32_pe[j+5]),
                WORD_AS_BYTES (pic32_pe[j+6]),
                WORD_AS_BYTES (pic32_pe[j+7]),
                WORD_AS_BYTES (pic32_pe[j+8]),
                WORD_AS_BYTES (pic32_pe[j+9]),
            CMD_EXECUTE_SCRIPT, 10,             // execute
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF);
        check_timeout (a, "step7");
    }
    mdelay (100);

