sergev/pic32prog/adapter-pickit2.c
static void pickit2_program_row128 (adapter_t *adapter, unsigned addr,
    unsigned *data)
{
    pickit2_adapter_t *a = (pickit2_adapter_t*) adapter;
    unsigned i;

    if (debug_level > 0)
        fprintf (stderr, "PICkit2: row program 512 bytes at %08x\n",  addr);
    if (! a->use_executable) {
        /* Without PE. */
        fprintf (stderr, "PICkit2: slow flash write not implemented yet.\n");
        exit (-1);
    }
    /* Use PE to write flash memory. */

    pickit2_send (a, 15, CMD_CLEAR_UPLOAD_BUFFER,
        CMD_EXECUTE_SCRIPT, 12,
            SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
            SCRIPT_JT2_XFRFASTDAT_LIT,
		128, 0, 0, 0,                     // PROGRAM ROW
	    SCRIPT_JT2_XFRFASTDAT_LIT,
		(unsigned char) addr,
		(unsigned char) (addr >> 8),
		(unsigned char) (addr >> 16),
		(unsigned char) (addr >> 24));

    /* Download 512 bytes of data. */

    for (i = 0; i < 2; i++) {
        /* Download 256 bytes of data. */
        download_data (a, data, 15, 1);
        download_data (a, data+15, 15, 0);
        download_data (a, data+30, 15, 0);
        download_data (a, data+45, 15, 0);

        pickit2_send (a, 26,
            CMD_DOWNLOAD_DATA, 4*4,
                WORD_AS_BYTES (data[60]),
                WORD_AS_BYTES (data[61]),
                WORD_AS_BYTES (data[62]),
                WORD_AS_BYTES (data[63]),
            CMD_EXECUTE_SCRIPT, 6,              // execute
                SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_LOOP, 1, 63);

        data += 64;
    }

    pickit2_send (a, 5, CMD_CLEAR_UPLOAD_BUFFER,
        CMD_EXECUTE_SCRIPT, 1,
            SCRIPT_JT2_GET_PE_RESP,
        CMD_UPLOAD_DATA);

    pickit2_recv (a);
    //fprintf (stderr, "PICkit2: program PE response %u bytes: %02x...\n",
    //  a->reply[0], a->reply[1]);
    if (a->reply[0] != 4 || a->reply[1] != 0) { // response code 0 = success
        fprintf (stderr, "PICkit2: failed to program row flash memory at %08x, reply = %02x-%02x-%02x-%02x-%02x\n",
            addr, a->reply[0], a->reply[1], a->reply[2], a->reply[3], a->reply[4]);
        exit (-1);
    }
}

/*
 * Erase all flash memory.
 */
static void pickit2_erase_chip (adapter_t *adapter)
{
    pickit2_adapter_t *a = (pickit2_adapter_t*) adapter;

    //fprintf (stderr, "PICkit2: erase chip\n");
    pickit2_send (a, 11, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 8,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_ERASE,
        SCRIPT_DELAY_LONG, 74);                 // 400 msec
    check_timeout (a, "chip erase");
}

/*
 * Initialize adapter PICkit2.
 * Return a pointer to a data structure, allocated dynamically.
 * When adapter not found, return 0.
 */
adapter_t *adapter_open_pickit2 (void)
{
    pickit2_adapter_t *a;
    hid_device *hiddev;

    hiddev = hid_open (MICROCHIP_VID, PICKIT2_PID, 0);
    if (! hiddev) {
        /*fprintf (stderr, "HID bootloader not found: vid=%04x, pid=%04x\n",
            MICROCHIP_VID, BOOTLOADER_PID);*/
        return 0;
    }
    a = calloc (1, sizeof (*a));
    if (! a) {
        fprintf (stderr, "Out of memory\n");
        return 0;
    }
    a->hiddev = hiddev;

    /* Read version of adapter. */
    pickit2_send (a, 2, CMD_CLEAR_UPLOAD_BUFFER, CMD_GET_VERSION);
    pickit2_recv (a);
    printf ("      Adapter: PICkit2 Version %d.%d.%d\n",
        a->reply[0], a->reply[1], a->reply[2]);

    /* Detach power from the board. */
    pickit2_send (a, 4, CMD_EXECUTE_SCRIPT, 2,
        SCRIPT_VDD_OFF,
        SCRIPT_VDD_GND_ON);

    /* Setup power voltage 3.3V, fault limit 2.81V. */
    unsigned vdd = (unsigned) (3.3 * 32 + 10.5) << 6;
    unsigned vdd_limit = (unsigned) ((2.81 / 5) * 255);
    pickit2_send (a, 4, CMD_SET_VDD, vdd, vdd >> 8, vdd_limit);

    /* Setup reset voltage 3.28V, fault limit 2.26V. */
    unsigned vpp = (unsigned) (3.28 * 18.61);
    unsigned vpp_limit = (unsigned) (2.26 * 18.61);
    pickit2_send (a, 4, CMD_SET_VPP, 0x40, vpp, vpp_limit);

    /* Setup serial speed. */
    unsigned divisor = 10;
    pickit2_send (a, 4, CMD_EXECUTE_SCRIPT, 2,
        SCRIPT_SET_ICSP_SPEED, divisor);

    /* Reset active low. */
    pickit2_send (a, 3, CMD_EXECUTE_SCRIPT, 1,
        SCRIPT_MCLR_GND_ON);

    /* Read board status. */
    pickit2_send (a, 2, CMD_CLEAR_UPLOAD_BUFFER, CMD_READ_STATUS);
    pickit2_recv (a);
    unsigned status = a->reply[0] | a->reply[1] << 8;
    if (debug_level > 0)
        fprintf (stderr, "PICkit2: status %04x\n", status);

    switch (status & ~STATUS_RESET) {
    case STATUS_VPP_GND_ON:
    case STATUS_VPP_GND_ON | STATUS_VPP_ON:
        /* Explorer 16 board: no need to enable power. */
        break;

    case STATUS_VDD_GND_ON | STATUS_VPP_GND_ON:
        /* Enable power to the board. */
        pickit2_send (a, 4, CMD_EXECUTE_SCRIPT, 2,
            SCRIPT_VDD_GND_OFF,
            SCRIPT_VDD_ON);

        /* Read board status. */
        pickit2_send (a, 2, CMD_CLEAR_UPLOAD_BUFFER, CMD_READ_STATUS);
        pickit2_recv (a);
        status = a->reply[0] | a->reply[1] << 8;
        if (debug_level > 0)
            fprintf (stderr, "PICkit2: status %04x\n", status);
        if (status != (STATUS_VDD_ON | STATUS_VPP_GND_ON)) {
            fprintf (stderr, "PICkit2: invalid status = %04x.\n", status);
            return 0;
        }
        /* Wait for power to stabilize. */
        mdelay (500);
        break;

    default:
        fprintf (stderr, "PICkit2: invalid status = %04x\n", status);
        return 0;
    }

    /* Enter programming mode. */
    pickit2_send (a, 42, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 39,
        SCRIPT_VPP_OFF,
        SCRIPT_MCLR_GND_ON,
        SCRIPT_VPP_PWM_ON,
        SCRIPT_BUSY_LED_ON,
        SCRIPT_SET_ICSP_PINS, 0,
        SCRIPT_DELAY_LONG, 20,                  // 100 msec
        SCRIPT_MCLR_GND_OFF,
        SCRIPT_VPP_ON,
        SCRIPT_DELAY_SHORT, 23,                 // 1 msec
        SCRIPT_VPP_OFF,
        SCRIPT_MCLR_GND_ON,
        SCRIPT_DELAY_SHORT, 47,                 // 2 msec
        SCRIPT_WRITE_BYTE_LITERAL, 0xb2,
        SCRIPT_WRITE_BYTE_LITERAL, 0xc2,
        SCRIPT_WRITE_BYTE_LITERAL, 0x12,
        SCRIPT_WRITE_BYTE_LITERAL, 0x0a,
        SCRIPT_MCLR_GND_OFF,
        SCRIPT_VPP_ON,
        SCRIPT_DELAY_LONG, 2,                   // 10 msec
        SCRIPT_SET_ICSP_PINS, 2,
        SCRIPT_JT2_SETMODE, 6, 0x1f,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_STATUS);
    pickit2_send (a, 1, CMD_UPLOAD_DATA);
    pickit2_recv (a);
    if (debug_level > 1)
        fprintf (stderr, "PICkit2: got %02x-%02x\n", a->reply[0], a->reply[1]);
    if (a->reply[0] != 1) {
        fprintf (stderr, "PICkit2: cannot get MCHP STATUS\n");
        pickit2_finish (a, 0);
        return 0;
    }
    if (! (a->reply[1] & MCHP_STATUS_CFGRDY)) {
        fprintf (stderr, "No device attached.\n");
        pickit2_finish (a, 0);
        return 0;
    }
    if (! (a->reply[1] & MCHP_STATUS_CPS)) {
        fprintf (stderr, "Device is code protected and must be erased first.\n");
        pickit2_finish (a, 0);
        return 0;
    }

    /* User functions. */
    a->adapter.close = pickit2_close;
    a->adapter.get_idcode = pickit2_get_idcode;
    a->adapter.load_executable = pickit2_load_executable;
    a->adapter.read_word = pickit2_read_word;
    a->adapter.read_data = pickit2_read_data;
    a->adapter.erase_chip = pickit2_erase_chip;
    a->adapter.program_word = pickit2_program_word;
    a->adapter.program_row128 = pickit2_program_row128;
    a->adapter.program_row32 = pickit2_program_row32;
    return &a->adapter;
}
